Autodesk.Revit.DB.Structure.RebarConstraintsManager.GetPreferredConstraintOnHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle)
Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle.
handle:
The RebarConstrainedHandle for which the user RebarConstraint is to be returned.
Returns:
The user prefered RebarConstraint applied to the RebarConstrainedHandle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.RemovePreferredConstraintFromHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle)
Clears the user-preferred RebarConstraint from the specified RebarConstrainedHandle.
Remarks:
After the preferred constraint is removed, the rebar will search for an appropriate
default constraint for the handle in its current position.  In some cases, this will
cause the handle to snap a small distance to a new target.  However, in many situations,
the handle will simply remain in its current position, and either continue to use the
same constraint target (while no longer treating that target as preferred), or acquire
a FixedDistancetoHostFace constraint to the nearest host element surface.
The handle will not, in general, be restored to the position it originally occupied
before the preferred constraint was applied.
handle:
The RebarConstrainedHandle for which the user RebarConstraint is to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.SetPreferredConstraintForHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.Structure.RebarConstraint)
Sets the RebarConstraint as preferred constraint target for the specified RebarConstrainedHandle.
Remarks:
The RebarConstraint should be one of the candidate RebarConstraints returned by
getConstraintCandidatesForHandle.
In general, the caller should assume that the 'set' operation can fail, as some
of the candidates may be legal targets for the handle, but may cause the rebar
to flex into an insoluble shape.
Once a preferred constraint has been successfully assigned to a handle, the
user can still drag the handle, and the Rebar can generally be flexed in much
the same way as it could before (preferred constraints do not have the same
effect as Revit locked dimensions).  However, the rebar's behavior will change
in subtle ways.
A handle with a FixedDistanceToHostFace preferred constraint will allow the
constraint's offset distance to change as the user moves the handle.  However,
in subsequent model updates, the handle will continue to follow the preferred
constraint target, even if other legitimate constraint targets are closer to
the handle.  One can think of this behavior as equivalent to unlocking a
locked dimension, moving one of dimension references, and then re-locking the
dimension - all in one step.
When a handle with a ToCover or ToOtherRebar preferred constraint is dragged by
the user, it will snap back to its constraint target, unless it is dragged
beyond tolerance distance.  In that case, it will select a new constraint using
default logic, but will continue to treat the "broken" constraint as preferred,
and will snap back to the preferred target again, if it is dragged to within
tolerance distance.
If, during a model update, the rebar determines that a preferred constraint
target no longer exists, or has been modified so that it is no longer a legal
candidate for the handle, then the rebar will remove the preferred status of
that target and will assign a new constraint to the handle using the default
logic.
handle:
The RebarConstrainedHandle to which the new RebarConstraint is to be applied.
constraint:
The new RebarConstraint to be applied to the RebarConstrainedHandle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
constraint is no longer valid.
-or-
handle is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.GetConstraintCandidatesForHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle)
Returns all possible RebarConstraints that could be used for a specified RebarConstrainedHandle.
handle:
The RebarConstrainedHandle for which constraint candidates are sought.
Returns:
A collection of RebarConstraints
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.GetCurrentConstraintOnHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle)
Retrieves the RebarConstraint that acts on the specified RebarConstraintHandle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.IsRebarConstrainedPlacementEnabled
A static property defining if the 'Rebar Constrained Placement' setting is on or off in current Revit Application Session.
Remarks:
If user started multiple Revit sessions, and the 'Rebar Constrained Placement' setting might be different in each session.
Revit.ini file stores the lastest setting no matter what the Revit session is. The setting will be writen to Revit.ini if user set the value.
This property enables/disables constraints between standard style rebars.
This constraint is similar to the standard-to-stirrup constraint in the following way :
Distance to target cannot be edited.
The constraint "snaps" the rebars together in a touching position.
Rebars can be constrained under the following conditions :
Rebars have standard style. (not stirrups)The segments must be touching. (patially overlapped)If the segments are perfectly overlapped (i.e segments have the same center line) then the constraint will not take place.Only one segment per rebar can be constrained.If one of the segments touches (intersects) more than one segment (or arc), then the constraint will not happen.The segments being constrained are parallel and the bending and segment planes are parallel.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager
A class used to obtain information about the constraints (RebarConstraints) acting
on the shape handles (RebarConstrainedHandles) of a Rebar element, and to replace
default constraints with user-preferred choices.
Remarks:
A RebarConstraintsManager is created by calling Rebar.GetRebarConstraintsManager(),
and can only be used to query or change constraints on the rebar element that
created it.
By default, Revit uses the following logic to choose constraints for each handle
on a rebar element.  First, a search is performed to find all suitable target
planes, including surfaces of the rebar's host, as well as surfaces on other
concrete host elements that are attached to the rebar's host.  In the case of
standard style rebar, any host surface occupied by a stirrup will be ignored,
and instead, the handles on the stirrup itself will be treated as candidates
to form a constraint.
Once all the constraint target candidates have been determined, the following
sequence is used to select a constraint target:
If the rebar is a straight standard bar, it will search the list of candidates
for stirrup bends to lock its RebarPlane and Edge handles.  If a bend is found within
tolerance distance, then the bar will be snapped and constrained to that bend.The bar will snap and constrain its handle to any host cover or stirrup handle
that lies within tolerance distance.If no candidate is found within tolerance, then the bar will choose nearest
host surface target, with or without cover, and create a constant distance constraint
to that surface.
Snapping tolerances are 0.5 * bar diameter for host surface cover constraints and
0.5 * (bar diameter + stirrup bar diameter) for stirrup handle constraints.
The RebarConstraintsManager allows the API developer to obtain the constraint
candidates for each constrained handle on a rebar, and to override the default
target selection logic by setting a particular constraint as preferred.  This
can be useful in a number of ways.  First, it can be used to snap a handle to a
particular host surface or stirrup rebar handle, or to position a handle at a
precise distance from a host surface.  Second, it can force a rebar handle to
constrain itself to a particular target surface, even if other targets are closer
(or will become closer in subsequent updates of the Revit model).  For example,
a bar can be constrained to maintain a constant offset distance from a face of
an opening in a slab, even if the opening is placed close to the edge of the slab
and the bar would normally constrain itself to the slab edge.  Lastly, the override
can be used to cancel the default standard bar preference for stirrup bar handle
planes, and to allow standard bars to be constrained to host cover surfaces, even
when a stirrup is present.
Since:
2014